<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#La-connexion-à-la-base-de-données-PostgreSQL" data-toc-modified-id="La-connexion-à-la-base-de-données-PostgreSQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>La connexion à la base de données PostgreSQL</a></span></li><li><span><a href="#Les-regroupements" data-toc-modified-id="Les-regroupements-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Les regroupements</a></span><ul class="toc-item"><li><span><a href="#La-copy-d'un-DataFrame" data-toc-modified-id="La-copy-d'un-DataFrame-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>La copy d'un DataFrame</a></span></li><li><span><a href="#Le-groupby" data-toc-modified-id="Le-groupby-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Le groupby</a></span></li><li><span><a href="#Assign" data-toc-modified-id="Assign-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Assign</a></span></li></ul></li><li><span><a href="#Les-équijointures" data-toc-modified-id="Les-équijointures-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Les équijointures</a></span></li><li><span><a href="#Les-jointures-externes" data-toc-modified-id="Les-jointures-externes-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Les jointures externes</a></span></li></ul></div>

In [1]:
import pandas as pd 
import seaborn as sns
import warnings 
import os
import sqlalchemy

from datetime import datetime
warnings.filterwarnings(action="ignore")

%pylab inline
%load_ext sql

plt.style.use('seaborn-darkgrid')
sns.set(font_scale=3)

%pylab is deprecated, use %matplotlib inline and import the required libraries.
Populating the interactive namespace from numpy and matplotlib

# La connexion à la base de données PostgreSQL

**`postgresql://user:pass@host:port/dbname[?key=value&key=value...]`**<br>
**`engine = create_engine("postgresql://scott:tiger@localhost/test")`**<br>

In [2]:
engine = sqlalchemy.create_engine("postgresql://")
connection = engine.connect()
print("connecting with engine " + str(engine))

connecting with engine Engine(postgresql://stagiaire:***@51.91.76.248:15432/cours)

In [3]:
%sql postgresql://

La lecture d'une table et le chargement dans un DataFrame

In [4]:
query = """
            select * 
            from categories
         """
categories = pd.read_sql_query(query, connection) #df.to_sql('nom', con=engine,if_exists='replace')
categories

,code_categorie,nom_categorie,description
0,1.0,Boissons,"Boissons, cafés, thés, bières"
1,2.0,Condiments,"Sauces, assaisonnements et épices"
2,3.0,Desserts,Desserts et friandises
3,4.0,Produits laitiers,Fromages
4,5.0,Pâtes et céréales,"Pains, biscuits, pâtes et céréales"
5,6.0,Viandes,Viandes préparées
6,7.0,Produits secs,"Fruits secs, raisins, autres"
7,8.0,Poissons et fruits de mer,"Poissons, fruits de mer, escargots"
8,9.0,Conserves,"Fruits, légumes en conserve et confitures"
9,10.0,Viande en conserve,Viande en conserve

# Les regroupements

In [5]:
query = """
            select co.no_commande, 
                   co.code_client, 
                   co.no_employe, 
                   co.date_commande,
                   cast(extract(year from co.date_commande) as int) annee, 
                   cast(extract(QUARTER from co.date_commande) as int) trimestre, 
                   cast(extract(month from co.date_commande) as int)  mois,
                   co.date_envoi, 
                   co.port, 
                   co.livree, 
                   co.acquitee, 
                   co.annulee, 
                   dc.ref_produit, 
                   dc.prix_unitaire, 
                   dc.quantite, 
                   dc.remise, 
                   dc.retourne,
echange 
            from commandes co 
                 join details_commandes dc 
                 on co.no_commande = dc.no_commande
            --FETCH FIRST 100 ROWS ONLY
         """
df = pd.read_sql_query(query, connection)
df.shape

(476091, 18)

## La copy d'un DataFrame

In [6]:
det_comm = df.copy()
det_comm.columns = [x.lower() for x in det_comm.columns]

In [7]:
det_comm.head()

,no_commande,code_client,no_employe,date_commande,annee,trimestre,mois,date_envoi,port,livree,acquitee,annulee,ref_produit,prix_unitaire,quantite,remise,retourne,echange
0,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,112.0,37.80,166.0,6.14,0.0,0.0
1,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,113.0,65.76,192.0,7.69,0.0,0.0
2,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,78.0,47.16,101.0,4.62,0.0,0.0
3,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,47.0,63.24,119.0,7.49,0.0,0.0
4,215576.0,PICCO,46.0,2010-01-29,2010,1,1,2010-02-20,90.5,1.0,1.0,0.0,62.0,94.56,128.0,15.71,0.0,0.0

## Le groupby

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-03.png" width="400">

In [8]:
%%sql  
select extract(year from date_commande) annee, 
       extract(QUARTER from date_commande) trimestre, 
       extract(month from date_commande)  mois, 
       sum(quantite) quantite_sum, 
       avg(quantite) quantite_avg, 
       sum(port) port_sum, 
       min(port) port_min, 
       max(port) port_max, 
       avg(port) port_avg 
from commandes co 
   join details_commandes dc
      on co.no_commande = dc.no_commande 
group by annee,trimestre,mois 
order by annee,trimestre,mois

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
18 rows affected.

[(2010.0, 1.0, 1.0, Decimal('2586939'), Decimal('110.5246090745962574'), Decimal('1768095.20'), Decimal('50.00'), Decimal('100.00'), Decimal('75.5402546355635307')),
 (2010.0, 1.0, 2.0, Decimal('2422312'), Decimal('109.4582919114324446'), Decimal('1652843.40'), Decimal('50.10'), Decimal('100.00'), Decimal('74.6879078174423859')),
 (2010.0, 1.0, 3.0, Decimal('2562429'), Decimal('109.6930222602739726'), Decimal('1737846.90'), Decimal('50.30'), Decimal('99.90'), Decimal('74.3941309931506849')),
 (2010.0, 2.0, 4.0, Decimal('2413987'), Decimal('109.7915586482921726'), Decimal('1652110.20'), Decimal('50.00'), Decimal('100.00'), Decimal('75.1403192795742939')),
 (2010.0, 2.0, 5.0, Decimal('2662399'), Decimal('109.3208097232487476'), Decimal('1815609.20'), Decimal('50.10'), Decimal('100.00'), Decimal('74.5507596288084093')),
 (2010.0, 2.0, 6.0, Decimal('2538585'), Decimal('109.4123351435221102'), Decimal('1731709.80'), Decimal('50.10'), Decimal('99.90'), Decimal('74.6362296353762607')),
 (2010.0, 3.0, 7.0, Decimal('2568649'), Decimal('110.5127995525534570'), Decimal('1755303.90'), Decimal('50.10'), Decimal('99.90'), Decimal('75.5196790431527772')),
 (2010.0, 3.0, 8.0, Decimal('2722756'), Decimal('109.9747960255271024'), Decimal('1867152.10'), Decimal('50.10'), Decimal('100.00'), Decimal('75.4161119638096777')),
 (2010.0, 3.0, 9.0, Decimal('2491305'), Decimal('109.5223545962104893'), Decimal('1684754.60'), Decimal('50.20'), Decimal('100.00'), Decimal('74.0649140546006067')),
 (2010.0, 4.0, 10.0, Decimal('2823864'), Decimal('109.5965225490957075'), Decimal('1939238.00'), Decimal('50.00'), Decimal('100.00'), Decimal('75.2634479546689436')),
 (2010.0, 4.0, 11.0, Decimal('2579959'), Decimal('109.9820530309489300'), Decimal('1747349.40'), Decimal('50.20'), Decimal('100.00'), Decimal('74.4884218603461506')),
 (2010.0, 4.0, 12.0, Decimal('2458342'), Decimal('109.2887881212767849'), Decimal('1674241.40'), Decimal('50.10'), Decimal('99.90'), Decimal('74.4305770427669601')),
 (2011.0, 1.0, 1.0, Decimal('3473146'), Decimal('109.9583992908250491'), Decimal('2358136.90'), Decimal('50.00'), Decimal('100.00'), Decimal('74.6576616222377002')),
 (2011.0, 1.0, 2.0, Decimal('3411984'), Decimal('109.8301680293568532'), Decimal('2331253.80'), Decimal('50.10'), Decimal('100.00'), Decimal('75.0419687117749308')),
 (2011.0, 1.0, 3.0, Decimal('3818542'), Decimal('110.0983767263500851'), Decimal('2618142.10'), Decimal('50.10'), Decimal('100.00'), Decimal('75.4877634576017069')),
 (2011.0, 2.0, 4.0, Decimal('3586065'), Decimal('110.0222433576731914'), Decimal('2422907.60'), Decimal('50.10'), Decimal('100.00'), Decimal('74.3360004908878935')),
 (2011.0, 2.0, 5.0, Decimal('3552664'), Decimal('109.5149198520345253'), Decimal('2417137.00'), Decimal('50.10'), Decimal('100.00'), Decimal('74.5110049321824908')),
 (2011.0, 2.0, 6.0, Decimal('3596965'), Decimal('109.6067586921412682'), Decimal('2464942.70'), Decimal('50.10'), Decimal('99.90'), Decimal('75.1117621964225859'))]

In [9]:
det_comm.columns

Index(['no_commande', 'code_client', 'no_employe', 'date_commande', 'annee',
       'trimestre', 'mois', 'date_envoi', 'port', 'livree', 'acquitee',
       'annulee', 'ref_produit', 'prix_unitaire', 'quantite', 'remise',
       'retourne', 'echange'],
      dtype='object')

In [10]:
gb_dc = det_comm.groupby(['annee','trimestre','mois'])

In [11]:
gb_dc.agg({'quantite':['sum','mean'],'port':['sum','min','max','mean']}).head()

                       quantite                   port
                            sum        mean        sum   min    max       mean
annee trimestre mois
2010  1         1     2586939.0  110.524609  1768095.2  50.0  100.0  75.540255
                2     2422312.0  109.458292  1652843.4  50.1  100.0  74.687908
                3     2562429.0  109.693022  1737846.9  50.3   99.9  74.394131
      2         4     2413987.0  109.791559  1652110.2  50.0  100.0  75.140319
                5     2662399.0  109.320810  1815609.2  50.1  100.0  74.550760

In [12]:
gb_dc.agg({'prix_unitaire':'std'}).head()

                      prix_unitaire
annee trimestre mois
2010  1         1         16.981045
                2         16.987277
                3         17.012675
      2         4         17.048913
                5         16.992424

## Assign

In [13]:
df_dc = det_comm.assign(
                 ca_brut = det_comm.quantite*det_comm.prix_unitaire,
                 remise  = det_comm.quantite*det_comm.prix_unitaire*det_comm.remise/100,
                 ca_net  = det_comm.quantite*det_comm.prix_unitaire - 
                          (det_comm.quantite*det_comm.prix_unitaire*det_comm.remise/100)                
                ).groupby(
                          ['annee','trimestre','mois']
                         ).agg(
                               {'quantite':['sum','mean'],
                                'port'    :['sum','min','max','mean'],
                                'ca_brut' :['sum'],
                                'remise'  :['sum'],
                                'ca_net'  :['sum'],
                                 })
df_dc.head()

                       quantite                   port               \
                            sum        mean        sum   min    max
annee trimestre mois
2010  1         1     2586939.0  110.524609  1768095.2  50.0  100.0
                2     2422312.0  109.458292  1652843.4  50.1  100.0
                3     2562429.0  109.693022  1737846.9  50.3   99.9
      2         4     2413987.0  109.791559  1652110.2  50.0  100.0
                5     2662399.0  109.320810  1815609.2  50.1  100.0

                                      ca_brut        remise        ca_net
                           mean           sum           sum           sum
annee trimestre mois
2010  1         1     75.540255  1.698266e+08  1.487704e+07  1.549496e+08
                2     74.687908  1.585268e+08  1.379942e+07  1.447274e+08
                3     74.394131  1.677318e+08  1.466487e+07  1.530669e+08
      2         4     75.140319  1.577834e+08  1.379868e+07  1.439847e+08
                5     74.550760  1.743042e+08  1.526195e+07  1.590423e+08

In [14]:
df_dc.columns = [col[0]+'_'+col[1] for col in df_dc.columns]
df_dc.head()

                      quantite_sum  quantite_mean   port_sum  port_min  \
annee trimestre mois
2010  1         1        2586939.0     110.524609  1768095.2      50.0
                2        2422312.0     109.458292  1652843.4      50.1
                3        2562429.0     109.693022  1737846.9      50.3
      2         4        2413987.0     109.791559  1652110.2      50.0
                5        2662399.0     109.320810  1815609.2      50.1

                      port_max  port_mean   ca_brut_sum    remise_sum  \
annee trimestre mois
2010  1         1        100.0  75.540255  1.698266e+08  1.487704e+07
                2        100.0  74.687908  1.585268e+08  1.379942e+07
                3         99.9  74.394131  1.677318e+08  1.466487e+07
      2         4        100.0  75.140319  1.577834e+08  1.379868e+07
                5        100.0  74.550760  1.743042e+08  1.526195e+07

                        ca_net_sum
annee trimestre mois
2010  1         1     1.549496e+08
                2     1.447274e+08
                3     1.530669e+08
      2         4     1.439847e+08
                5     1.590423e+08

In [15]:
df_dc.reset_index().head()

,annee,trimestre,mois,quantite_sum,quantite_mean,port_sum,port_min,port_max,port_mean,ca_brut_sum,remise_sum,ca_net_sum
0,2010,1,1,2586939.0,110.524609,1768095.2,50.0,100.0,75.540255,1.698266e+08,1.487704e+07,1.549496e+08
1,2010,1,2,2422312.0,109.458292,1652843.4,50.1,100.0,74.687908,1.585268e+08,1.379942e+07,1.447274e+08
2,2010,1,3,2562429.0,109.693022,1737846.9,50.3,99.9,74.394131,1.677318e+08,1.466487e+07,1.530669e+08
3,2010,2,4,2413987.0,109.791559,1652110.2,50.0,100.0,75.140319,1.577834e+08,1.379868e+07,1.439847e+08
4,2010,2,5,2662399.0,109.320810,1815609.2,50.1,100.0,74.550760,1.743042e+08,1.526195e+07,1.590423e+08

# Les équijointures

<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/612.png" width="800">

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-07.png" width="400">

In [16]:
%%sql 
select count(*) from employes

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(111,)]

In [17]:
%%sql 
select count(*) from commandes

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(13462,)]

In [18]:
%%sql 
select count(*) from clients

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(91,)]

In [19]:
%%sql 
select count(*) 
     from employes em 
          inner join commandes co 
               on em.no_employe = co.no_employe 
          inner join clients cl 
               on cl.code_client = co.code_client

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(13462,)]

In [20]:
commandes = pd.read_sql_query("select * from commandes",connection)
employes  = pd.read_sql_query("select * from employes",connection)
clients  = pd.read_sql_query("select * from clients",connection)

In [21]:
employes.head()

,no_employe,rend_compte,nom,prenom,fonction,titre,date_naissance,date_embauche,salaire,commission,pays,region
0,37.0,NaN,Giroux,Jean-Claude,Président,M.,1979-04-28,2002-03-08,150000.0,NaN,None,None
1,14.0,37.0,Fuller,Andrew,Vice-Président,M.,1984-06-27,2003-08-09,96000.0,NaN,None,Amériques
2,18.0,37.0,Brasseur,Hervé,Vice-Président,M.,1980-05-29,2001-10-26,147000.0,NaN,None,Europe
3,24.0,14.0,Buchanan,Steven,Chef des ventes,M.,1972-11-26,1995-02-09,13000.0,12940.0,None,Amérique du Nord
4,95.0,18.0,Leger,Pierre,Chef des ventes,M.,1989-09-01,2002-09-07,19000.0,11150.0,None,Europe du Nord

In [22]:
employes.merge(commandes, on='no_employe').merge(clients, on='code_client').shape

(13462, 27)

In [23]:
employes.merge(commandes, on='no_employe').merge(clients, on='code_client').head()

,no_employe,rend_compte,nom,prenom,fonction,titre,date_naissance,date_embauche,salaire,commission,...,livree,acquitee,annulee,societe,adresse,ville,code_postal,pays_y,telephone,fax
0,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
1,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,1.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
2,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
3,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None
4,1.0,86.0,Besse,José,Représentant(e),M.,1984-03-28,2002-02-06,9900.0,940.0,...,1.0,1.0,0.0,B's Beverages,Fauntleroy Circus,London,EC2 5NT,Royaume-Uni,(71) 555-1212,None

# Les jointures externes 

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-07.png" width="400">

In [24]:
%sql select count(*) from employes

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(111,)]

In [25]:
%sql select count(distinct no_employe) from commandes

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(92,)]

In [26]:
%%sql 
select count(*) lignes,
     count(distinct em.no_employe) as emp_employes ,
     count(distinct co.no_employe) as emp_commandes 
from employes em 
          left outer join commandes co 
               on em.no_employe = co.no_employe

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(13481, 111, 92)]

<img src="https://raw.githubusercontent.com/rbizoi/Ecole-IA-Strasbourg/master/images/documents/M06-08.png" width="400">

In [27]:
%%sql 
select em.no_employe,
       sum(port) port
from employes em 
  left outer join commandes co 
       on em.no_employe = co.no_employe 
group by em.no_employe 
order by port nulls first fetch next 25 rows only

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
25 rows affected.

[(Decimal('23'), None),
 (Decimal('44'), None),
 (Decimal('24'), None),
 (Decimal('27'), None),
 (Decimal('89'), None),
 (Decimal('18'), None),
 (Decimal('104'), None),
 (Decimal('57'), None),
 (Decimal('109'), None),
 (Decimal('33'), None),
 (Decimal('64'), None),
 (Decimal('11'), None),
 (Decimal('37'), None),
 (Decimal('14'), None),
 (Decimal('30'), None),
 (Decimal('21'), None),
 (Decimal('75'), None),
 (Decimal('86'), None),
 (Decimal('95'), None),
 (Decimal('8'), Decimal('1503.10')),
 (Decimal('82'), Decimal('1609.80')),
 (Decimal('76'), Decimal('1625.20')),
 (Decimal('36'), Decimal('1770.30')),
 (Decimal('61'), Decimal('1943.90')),
 (Decimal('34'), Decimal('2159.70'))]

In [28]:
%%sql 
select 
    count(*),
    count(distinct em.no_employe),
    count(distinct co.no_employe) 
from employes em 
  left outer join commandes co 
       on em.no_employe = co.no_employe 
where extract(year from co.date_commande) = 2010

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(7969, 92, 92)]

Toutefois la requête précédente ne retourne pas les employés qui n’ont pas passé de commande, car la condition ``annee = 2010`` impose également l’existence d’un enregistrement dans la table **COMMANDES**.

In [29]:
%%sql 
select count(*),
    count(distinct em.no_employe),
    count(distinct co.no_employe) 
from employes em 
  left outer join commandes co 
       on em.no_employe = co.no_employe 
where coalesce(extract(year from co.date_commande),2010) = 2010

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(7988, 111, 92)]

In [30]:
%%sql 
select count(*),
     count(distinct em.no_employe),
     count(distinct co.no_employe) 
     from employes em 
          left outer join commandes co 
               on em.no_employe = co.no_employe 
          left join clients cl 
               on cl.code_client = co.code_client

 * postgresql://stagiaire:***@51.91.76.248:15432/cours
1 rows affected.

[(13481, 111, 92)]

In [31]:
commandes = pd.read_sql_query("select * from commandes",connection)
employes  = pd.read_sql_query("select * from employes",connection).drop(columns=['pays','region'])
clients  = pd.read_sql_query("select * from clients",connection)

In [32]:
employes.set_index('no_employe').join(commandes.set_index('no_employe'),how='inner').shape

(13462, 17)

In [33]:
employes.set_index('no_employe').join(commandes.set_index('no_employe'),how='left').shape

(13481, 17)

Avec join c'est un peut casse tête à mon avis

In [34]:
employes.set_index(
                   'no_employe'
                   ).join(
                          commandes.set_index(
                                              'no_employe'
                                              ),
                           how='left'
                          ).reset_index().set_index(
                                                    'code_client'
                                                   ).join(
                                                          clients.set_index(
                                                                            'code_client'
                                                                            ),
                                                          how='left').shape

(13481, 24)

In [35]:
employes.merge(commandes,on='no_employe',how='left').merge(clients,on='code_client',how='left').shape

(13481, 25)